Revit 2027 API
SizingOptions.MaxSize Property
 The maximal size in feet, defaults to 2 feet.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double MaxSize { get; set; }
Public Property MaxSize As Double
	Get
	Set
public:
property double MaxSize {
	double get ();
	void set (double value);
}
member MaxSize : float with get, set
Property Value
Double
See Also
Reference
SizingOptions Class
Autodesk.Revit.DB.Analysis Namespace